---
kind: property
id: P:Autodesk.Revit.DB.RelinquishedItems.IsValidObject
source: html/0ba0aa11-1007-e495-0704-1fe9e39eec65.htm
---
# Autodesk.Revit.DB.RelinquishedItems.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.